import re
stroka = input()
pattern = r'([aAEeIiOoUuYy]+)'
for i in stroka:
    result = re.findall(pattern, stroka)
print(*result, sep='')

"""только гласные буквы (a, e, i, o, u,  y) для управления магией. Вам нужно из текста заклинания извлечь только гласные, чтобы расшифровать его.

Программа должна:

Принять от пользователя строку (заклинание).
Вывести все гласные буквы из заклинания в порядке их появления."""