x = int(input())
counter = 0
for i in range(1, x + 1):
     counter += i
print(counter)

"""Напишите программу, которая запрашивает у пользователя число и вычисляет сумму всех чисел от 1 до этого числа включительно с использованием цикла for и range()"""
 