stroka = input().split()
vv = len(stroka)
for i in range(1, vv, 2):
    print(stroka[i], end=' ')
    

"""Программа должна:

Принять от пользователя строку (заклинание).
Разделить строку на слова.
Вывести только каждое второе слово (начиная со второго)."""