
date = input()
spisok = date.replace("-", " ").split()# создается список через запятую
year = spisok[0] 
mouns = spisok[1]
day = spisok[2]

d = {'01': 'января', '02': 'февраля', '03': 'марта', '04': 'апреля', '05': 'мая', '06': 'июня', '07': 'июля', '08': 'августа', '09': 'сентября', '10': 'октября', '11': 'ноября', '12': 'декабря'} # создаем словарь ключ- значение, чтобы вытащить нужное значение

print(f"{day} {d[mouns]} {year}") # выводим в нужном порядке. Из словаря достаем нужное значение, обратившись к переменной, в которой записан ключ (например, 03)для замены на март

"""
Вам нужно форматировать строку с датой, где дата передается в формате год-месяц-день. Необходимо преобразовать эту строку в формат День месяца Месяц, Год. Используйте метод .format() для форматирования.

Пример:
Входные данные: 2024-12-01
Выходные данные: 01 декабря 2024"""