import re
num = input()
result = re.findall(r"(\+7-\d{3}-\d{3}-\d{2}-\d{2})", num) # заключить в скобки условия-это группа, экранировать +
print(*result)

"""1. Получите строку от пользователя с номерами телефонов, разделёнными пробелами.
2. Найдите все номера в формате +7-XXX-XXX-XX-XX.
3.Выведите все корректные номера через пробел."""