text = input()
print(text.strip().replace(' ', "_"))

"""
Напишите программу, которая принимает строку, удаляет пробелы с обоих концов и заменяет все оставшиеся пробелы внутри строки на подчёркивания (_). Выведите результат.

Sample Input:

   hello world   python programming  

Sample Output:
hello_world___python_programming"""